app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def show
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1

  def edit
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1

  def create
    # render plain: params[:article].inspect

    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('123', '123', '2015-09-28 06:54:03', '2015-09-28 06:54:03')

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 4 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 4